{
  "locales": {
    "en": {
      "title": "Experience",
      "title_long_prefix": "Summary of my",
      "title_long": "**Work** Experience"
    },
    "es": {
      "title": "Experiencia",
      "title_long_prefix": "Resumen de mi",
      "title_long": "Experiencia **Laboral**"
    },
    "fr": {
      "title": "Expérience",
      "title_long_prefix": "Résumé de mon",
      "title_long": "Expérience **Professionnelle**"
    },
    "ko": {
      "title": "경험",
      "title_long_prefix": "제",
      "title_long": "**직무** 경험"
    }
  },

  "articles": [
    {
      "id": "work",
      "component": "ArticleTimeline",
      "config": {},
      "locales": {},

      "items": [
        {
          "icon": {
            "img": "images/pictures/capita.jpeg",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {
            "start": "06/01/2014",
            "end": "08/01/2015"
          },
          "locales": {
            "en": {
              "title": "**Placement** Service Desk Analyst",
              "info": "Capita, Newtownabbey",
              "text": "<p>Provided a first, and single, point of contact into Capita Services Desks for all supported businesses.</p><p>Deliver outstanding customer service a standard by answering all calls promptly, remaining courteous and professional at all times.</p><p>Ensuring incoming incidents are logged accurately and that sufficient information is recorded in the relevant incident logging software, and following and adhering to stringent processes.</p><p>Ensuring that all cases owned are resolved in accordance to the agreed Service Level Agreement (SLA).</p><p>Training and mentoring new starters.</p><p>Dealing with high level escalations.</p><p>Diagnosing & troubleshooting hardware, software and networking incidents.</p><p>Manually running install packages through Altiris console & Altiris client cache.</p><p>Helping build a greater First Line Fix (FLF) capability within the Service Desk.</p>",
              "tags": []
            },
            "es": {
              "title": "Analista de la Mesa de Ayuda en **Prácticas**",
              "info": "Capita, Newtownabbey",
              "text": "<p>Proporcioné un primer y único punto de contacto con las Mesas de Servicio de Capita para todas las empresas compatibles.</p><p>Brindé un excelente servicio al cliente respondiendo a todas las llamadas con prontitud, manteniendo la cortesía y la profesionalidad en todo momento.</p><p>Aseguré de que los incidentes entrantes se registraran con precisión y de que se registrara información suficiente en el software de registro de incidentes correspondiente, siguiendo y adhiriéndose a procesos estrictos.</p><p>Garantizando que todos los casos propios se resolvieran de acuerdo con el Acuerdo de Nivel de Servicio (SLA) acordado.</p><p>Capacitación y tutoría de nuevos empleados.</p><p>Gestión de escalaciones de alto nivel.</p><p>Diagnóstico y resolución de problemas de hardware, software e incidentes de redes.</p><p>Ejecución manual de paquetes de instalación a través de la consola Altiris y la caché del cliente Altiris.</p><p>Ayudando a construir una mayor capacidad de Solución de Primera Línea (FLF) dentro de la Mesa de Ayuda.</p>",
              "tags": []
            },
            "fr": {
              "title": "Analyste du Centre de Services en **Stage**",
              "info": "Capita, Newtownabbey",
              "text": "<p>J'ai fourni un premier point de contact unique avec les centres de services de Capita pour toutes les entreprises prises en charge.</p><p>J'ai fourni un service client exceptionnel en répondant à tous les appels rapidement, en restant courtois et professionnel à tout moment.</p><p>Je me suis assuré que les incidents entrants étaient enregistrés avec précision et que des informations suffisantes étaient enregistrées dans le logiciel d'enregistrement des incidents pertinent, en suivant et en respectant des processus stricts.</p><p>Je me suis assuré que tous les dossiers en ma possession étaient résolus conformément à l'accord de niveau de service (SLA) convenu.</p><p>Formation et mentorat des nouveaux employés.</p><p>Gestion des escalades de haut niveau.</p><p>Diagnostic et dépannage des incidents matériels, logiciels et de réseau.</p><p>Exécution manuelle de packages d'installation via la console Altiris et le cache client Altiris.</p><p>Contribution à l'amélioration de la capacité de résolution au premier appel (FLF) au sein du centre de services.</p>",
              "tags": []
            },
            "ko": {
              "title": "**인턴** 서비스 데스크 분석가",
              "info": "Capita, Newtownabbey",
              "text": "<p>지원되는 모든 비즈니스를 위해 Capita 서비스 데스크에 대한 첫 번째이자 유일한 연락 창구를 제공했습니다.</p><p>모든 전화를 신속하게 응대하고 항상 정중하고 전문적인 태도를 유지함으로써 탁월한 고객 서비스를 제공했습니다.</p><p>들어오는 사건이 정확하게 기록되고 충분한 정보가 관련 사건 기록 소프트웨어에 기록되었는지 확인하고 엄격한 절차를 따르고 준수했습니다.</p><p>소유한 모든 사례가 합의된 서비스 수준 계약(SLA)에 따라 해결되었는지 확인했습니다.</p><p>신규 입사자 교육 및 멘토링.</p><p>높은 수준의 에스컬레이션 처리.</p><p>하드웨어, 소프트웨어 및 네트워크 사고 진단 및 문제 해결.</p><p>Altiris 콘솔 및 Altiris 클라이언트 캐시를 통해 설치 패키지를 수동으로 실행.</p><p>서비스 데스크 내에서 더 큰 1차 해결(FLF) 역량을 구축하는 데 도움을 주었습니다.</p>",
              "tags": []
            }
          }
        },
        {
          "icon": {
            "img": "images/pictures/fpmccann.png",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {
            "start": "06/01/2016",
            "end": "10/01/2018"
          },
          "locales": {
            "en": {
              "title": "**Graduate** Software Developer",
              "info": "FP McCann, Magherafelt",
              "text": "<p>Upgraded, extended and maintained an in-house business support system utillising a SQL database system.</p><p>Provide support for a range of client applications.</p><p>Working with the changing requirements of the employees in a responsive efficient manner often influencing the employees and engaging with key decision makers.</p><p>Consulted on the specification, implementation and deployment of software changes.</p><p>Managed the timely delivery of individual and group projects.</p><p>Responsible for all phases of a projects development lifecycle, from initial proposal through detailed planning, development, and test to final delivery.</p><p>Created in-house procedure documents, training manuals and help guides.</p><p>Coordinated client training to the introduction of upgrades and new functionality of the existing business support system.</p><p>Systematic testing of client applications.</p><p>Mentoring student placement software developers along with assigning and managing workloads for them.</p>",
              "tags": ["VB.NET", "C#", "SQL", "Winforms"]
            },
            "es": {
              "title": "Desarrollador de Software **Graduado**",
              "info": "FP McCann, Magherafelt",
              "text": "<p>Actualicé, extendí y mantuve un sistema interno de soporte empresarial utilizando un sistema de base de datos SQL.</p><p>Brindé soporte para una variedad de aplicaciones cliente.</p><p>Trabajé con los requisitos cambiantes de los empleados de manera receptiva y eficiente, a menudo influyendo en los empleados e interactuando con los responsables clave de la toma de decisiones.</p><p>Consulté sobre la especificación, implementación y despliegue de cambios de software.</p><p>Gestioné la entrega oportuna de proyectos individuales y grupales.</p><p>Responsable de todas las fases del ciclo de vida de desarrollo de un proyecto, desde la propuesta inicial hasta la planificación detallada, el desarrollo y las pruebas hasta la entrega final.</p><p>Creé documentos de procedimientos internos, manuales de capacitación y guías de ayuda.</p><p>Coordiné la capacitación del cliente para la introducción de actualizaciones y nuevas funcionalidades del sistema de soporte empresarial existente.</p><p>Pruebas sistemáticas de aplicaciones cliente.</p><p>Mentoring a estudiantes de desarrollo de software en prácticas, además de asignar y gestionar cargas de trabajo para ellos.</p>",
              "tags": ["VB.NET", "C#", "SQL", "Winforms"]
            },
            "fr": {
              "title": "Développeur Logiciel **Diplômé**",
              "info": "FP McCann, Magherafelt",
              "text": "<p>J'ai mis à niveau, étendu et maintenu un système interne de support commercial utilisant un système de base de données SQL.</p><p>J'ai fourni un support pour une gamme d'applications clientes.</p><p>J'ai travaillé avec les exigences changeantes des employés d'une manière réactive et efficace, influençant souvent les employés et en m'engageant avec les principaux décideurs.</p><p>J'ai consulté sur la spécification, l'implémentation et le déploiement des changements logiciels.</p><p>J'ai géré la livraison en temps voulu de projets individuels et de groupe.</p><p>J'ai été responsable de toutes les phases du cycle de développement d'un projet, de la proposition initiale à la planification détaillée, au développement et aux tests jusqu'à la livraison finale.</p><p>J'ai créé des documents de procédure internes, des manuels de formation et des guides d'aide.</p><p>J'ai coordonné la formation des clients à l'introduction de mises à niveau et de nouvelles fonctionnalités du système de support commercial existant.</p><p>Tests systématiques des applications clientes.</p><p>Mentorat des étudiants en développement logiciel en stage ainsi que l'attribution et la gestion des charges de travail pour eux.</p>",
              "tags": ["VB.NET", "C#", "SQL", "Winforms"]
            },
            "ko": {
              "title": "**졸업** 소프트웨어 개발자",
              "info": "FP McCann, Magherafelt",
              "text": "<p>SQL 데이터베이스 시스템을 활용하여 사내 비즈니스 지원 시스템을 업그레이드, 확장 및 유지 관리했습니다.</p><p>다양한 클라이언트 애플리케이션에 대한 지원을 제공했습니다.</p><p>직원들의 변화하는 요구 사항에 대응적이고 효율적으로 작업하면서 종종 직원들에게 영향을 미치고 주요 의사 결정자들과 소통했습니다.</p><p>소프트웨어 변경 사항의 사양, 구현 및 배포에 대해 자문했습니다.</p><p>개인 및 그룹 프로젝트의 적시 제공을 관리했습니다.</p><p>초기 제안부터 상세 계획, 개발, 테스트 및 최종 제공까지 프로젝트 개발 수명 주기의 모든 단계를 담당했습니다.</p><p>사내 절차 문서, 교육 매뉴얼 및 도움말 가이드를 작성했습니다.</p><p>기존 비즈니스 지원 시스템의 업그레이드 및 새로운 기능 도입에 대한 고객 교육을 조정했습니다.</p><p>클라이언트 애플리케이션의 체계적인 테스트.</p><p>학생 배치 소프트웨어 개발자를 멘토링하고 그들에게 업무를 할당하고 관리했습니다.</p>",
              "tags": ["VB.NET", "C#", "SQL", "Winforms"]
            }
          }
        },
        {
          "icon": {
            "img": "images/pictures/nitec.png",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {
            "start": "10/01/2018",
            "end": "03/01/2022"
          },
          "locales": {
            "en": {
              "title": "**Software** Developer",
              "info": "Nitec Solutions, Antrim",
              "text": "<p>Working to various clients, producing responsive web applications to help their business needs. The industries that I catered for included vessel transport management, medical patient management & consumer goods.</p><p>Upgraded, extended and maintained both client and in-house business critical systems using the latest web & cloud technologies.</p><p>Consulting on the specification, implementation and deployment of software product creation and improvement working in an agile environment.</p><p>Working closely with the customer through the full lifecycle which includes training and user acceptance and data migration.</p><p>Systematic testing of client applications, providing test scripts with expected outcomes.</p><p>Provided on and off site support for a range of client applications.</p><p>Creating a base project for the dev team which allows the download and use as a template for when starting their new projects. This also included a list of all the example components that I strongly recommended them to use.</p><p>Mentoring junior software developers.</p>",
              "tags": [
                "Javascript",
                "Azure",
                "C#",
                "React JS",
                "SQL",
                "HTML",
                "CSS",
                "Bootstrap"
              ]
            },
            "es": {
              "title": "Desarrollador de **Software**",
              "info": "Nitec Solutions, Antrim",
              "text": "<p>Trabajé para varios clientes, produciendo aplicaciones web responsivas para ayudar a sus necesidades comerciales. Las industrias a las que atendí incluyeron la gestión del transporte de buques, la gestión de pacientes médicos y bienes de consumo.</p><p>Actualicé, extendí y mantuve sistemas críticos de negocio tanto para clientes como internos utilizando las últimas tecnologías web y en la nube.</p><p>Consulté sobre la especificación, implementación y despliegue de la creación y mejora de productos de software trabajando en un entorno ágil.</p><p>Trabajé en estrecha colaboración con el cliente durante todo el ciclo de vida, lo que incluye la capacitación, la aceptación del usuario y la migración de datos.</p><p>Pruebas sistemáticas de aplicaciones cliente, proporcionando scripts de prueba con resultados esperados.</p><p>Brindé soporte in situ y fuera de sitio para una variedad de aplicaciones cliente.</p><p>Creé un proyecto base para el equipo de desarrollo que permite la descarga y el uso como plantilla para cuando comienzan sus nuevos proyectos. Esto también incluyó una lista de todos los componentes de ejemplo que les recomendé encarecidamente que usaran.</p><p>Mentoring a desarrolladores de software junior.</p>",
              "tags": [
                "Javascript",
                "Azure",
                "C#",
                "React JS",
                "SQL",
                "HTML",
                "CSS",
                "Bootstrap"
              ]
            },
            "fr": {
              "title": "Développeur **Logiciel**",
              "info": "Nitec Solutions, Antrim",
              "text": "<p>J'ai travaillé pour divers clients, produisant des applications web réactives pour répondre à leurs besoins commerciaux. Les secteurs pour lesquels j'ai travaillé comprenaient la gestion du transport maritime, la gestion des patients médicaux et les biens de consommation.</p><p>J'ai mis à niveau, étendu et maintenu des systèmes critiques pour l'entreprise, tant pour les clients qu'en interne, en utilisant les dernières technologies web et cloud.</p><p>J'ai participé à la spécification, à la mise en œuvre et au déploiement de la création et de l'amélioration de produits logiciels, en travaillant dans un environnement agile.</p><p>J'ai travaillé en étroite collaboration avec le client tout au long du cycle de vie, ce qui comprend la formation, l'acceptation par l'utilisateur et la migration des données.</p><p>Tests systématiques des applications clientes, fournissant des scripts de test avec les résultats attendus.</p><p>J'ai fourni un support sur site et hors site pour une gamme d'applications clientes.</p><p>J'ai créé un projet de base pour l'équipe de développement qui permet le téléchargement et l'utilisation comme modèle pour le démarrage de leurs nouveaux projets. Cela comprenait également une liste de tous les exemples de composants que je leur ai fortement recommandé d'utiliser.</p><p>Mentorat de jeunes développeurs de logiciels.</p>",
              "tags": [
                "Javascript",
                "Azure",
                "C#",
                "React JS",
                "SQL",
                "HTML",
                "CSS",
                "Bootstrap"
              ]
            },
            "ko": {
              "title": "**소프트웨어** 개발자",
              "info": "Nitec Solutions, Antrim",
              "text": "<p>다양한 고객을 위해 그들의 비즈니스 요구에 맞는 반응형 웹 애플리케이션을 제작했습니다. 제가 담당했던 산업 분야는 선박 운송 관리, 의료 환자 관리 및 소비재를 포함합니다.</p><p>최신 웹 및 클라우드 기술을 사용하여 클라이언트와 사내의 중요한 비즈니스 시스템을 업그레이드, 확장 및 유지 관리했습니다.</p><p>애자일 환경에서 작업하면서 소프트웨어 제품 생성 및 개선의 사양, 구현 및 배포에 대해 컨설팅했습니다.</p><p>교육, 사용자 수용 및 데이터 마이그레이션을 포함하는 전체 수명 주기를 통해 고객과 긴밀하게 협력했습니다.</p><p>예상 결과가 포함된 테스트 스크립트를 제공하여 클라이언트 애플리케이션을 체계적으로 테스트했습니다.</p><p>다양한 클라이언트 애플리케이션에 대한 온사이트 및 오프사이트 지원을 제공했습니다.</p><p>개발팀을 위한 기본 프로젝트를 만들어 새 프로젝트를 시작할 때 템플릿으로 다운로드하여 사용할 수 있도록 했습니다. 또한 제가 강력히 추천하는 모든 예제 구성 요소 목록을 포함했습니다.</p><p>주니어 소프트웨어 개발자를 멘토링했습니다.</p>",
              "tags": [
                "Javascript",
                "Azure",
                "C#",
                "React JS",
                "SQL",
                "HTML",
                "CSS",
                "Bootstrap"
              ]
            }
          }
        },
        {
          "icon": {
            "img": "images/pictures/learning_pool.jpeg",
            "fa": "",
            "faColors": { "bg": "#111", "fill": "#EEE" }
          },
          "dates": {
            "start": "03/01/2022",
            "end": "now"
          },
          "locales": {
            "en": {
              "title": "**Senior** Software Developer",
              "info": "Learning Pool, Derry",
              "text": "<p>Working in an agile environment developing and maintaining Moodle-based Learning Management Systems (LMS) using React, Javascript, Typescript, PHP and SQL.</p><p>Working closely with stakeholders in order to develop viable solutions to complex business requirements.</p><p>Contributing to the planning, scoping and technical design of bespoke software projects.</p><p>Working with other members of the software development team to ensure the successful and timely delivery of software projects.</p><p>Using unit-testing and other testing approaches to ensure the software is robust and reliable.</p><p>Reviewing code submissions from the team in order to meet coding standards.</p><p>Following continuous integration and deployment processes.</p><p>Being a group team leader while also having the responsibility of mentoring junior developers.</p>",
              "tags": [
                "React TS",
                "PHP",
                "Laravel",
                "SQL",
                "HTML",
                "CSS",
                "Material UI",
                "AWS",
                "Postman"
              ]
            },
            "es": {
              "title": "Desarrollador de Software **Senior**",
              "info": "Learning Pool, Derry",
              "text": "<p>Trabajo en un entorno ágil desarrollando y manteniendo Sistemas de Gestión del Aprendizaje (LMS) basados en Moodle utilizando React, Javascript, Typescript, PHP y SQL.</p><p>Trabajo en estrecha colaboración con las partes interesadas para desarrollar soluciones viables para requisitos empresariales complejos.</p><p>Contribuyo a la planificación, el alcance y el diseño técnico de proyectos de software a medida.</p><p>Trabajo con otros miembros del equipo de desarrollo de software para garantizar la entrega exitosa y oportuna de proyectos de software.</p><p>Utilizo pruebas unitarias y otros enfoques de prueba para asegurar que el software sea robusto y confiable.</p><p>Reviso las entregas de código del equipo para cumplir con los estándares de codificación.</p><p>Sigo procesos de integración y despliegue continuo.</p><p>Soy líder de equipo de grupo y también tengo la responsabilidad de mentorizar a desarrolladores junior.</p>",
              "tags": [
                "React TS",
                "PHP",
                "Laravel",
                "SQL",
                "HTML",
                "CSS",
                "Material UI",
                "AWS",
                "Postman"
              ]
            },
            "fr": {
              "title": "Développeur **Senior** de Logiciel",
              "info": "Learning Pool, Derry",
              "text": "<p>Je travaille dans un environnement agile, développant et maintenant des systèmes de gestion de l'apprentissage (LMS) basés sur Moodle à l'aide de React, Javascript, Typescript, PHP et SQL.</p><p>Je travaille en étroite collaboration avec les parties prenantes afin de développer des solutions viables pour des exigences commerciales complexes.</p><p>Je contribue à la planification, à la définition du périmètre et à la conception technique de projets logiciels sur mesure.</p><p>Je travaille avec les autres membres de l'équipe de développement logiciel pour assurer la livraison réussie et en temps voulu des projets logiciels.</p><p>J'utilise des tests unitaires et d'autres approches de test pour m'assurer que le logiciel est robuste et fiable.</p><p>J'examine les soumissions de code de l'équipe afin de respecter les normes de codage.</p><p>Je suis des processus d'intégration et de déploiement continus.</p><p>Je suis chef d'équipe de groupe tout en ayant la responsabilité de mentorer de jeunes développeurs.</p>",
              "tags": [
                "React TS",
                "PHP",
                "Laravel",
                "SQL",
                "HTML",
                "CSS",
                "Material UI",
                "AWS",
                "Postman"
              ]
            },
            "ko": {
              "title": "**수석** 소프트웨어 개발자",
              "info": "Learning Pool, Derry",
              "text": "<p>React, Javascript, Typescript, PHP 및 SQL을 사용하여 Moodle 기반 학습 관리 시스템(LMS)을 개발하고 유지 관리하는 애자일 환경에서 근무합니다.</p><p>복잡한 비즈니스 요구 사항에 대한 실행 가능한 솔루션을 개발하기 위해 이해 관계자와 긴밀하게 협력합니다.</p><p>맞춤형 소프트웨어 프로젝트의 계획, 범위 지정 및 기술 설계에 기여합니다.</p><p>소프트웨어 프로젝트의 성공적이고 적시적인 제공을 보장하기 위해 다른 소프트웨어 개발 팀 구성원과 협력합니다.</p><p>소프트웨어가 강력하고 안정적인지 확인하기 위해 단위 테스트 및 기타 테스트 접근 방식을 사용합니다.</p><p>코딩 표준을 충족하기 위해 팀의 코드 제출물을 검토합니다.</p><p>지속적인 통합 및 배포 프로세스를 따릅니다.</p><p>그룹 팀 리더인 동시에 주니어 개발자를 멘토링하는 책임을 맡고 있습니다.</p>",
              "tags": [
                "React TS",
                "PHP",
                "Laravel",
                "SQL",
                "HTML",
                "CSS",
                "Material UI",
                "AWS",
                "Postman"
              ]
            }
          }
        }
      ]
    }
  ]
}
